nc: 10

scales:
  s: [0.33, 0.5, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, MFE_C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, MFE_C2f, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, MFE_C2f, [512]]
  - [-1, 1, PLKF, [512, 5]]

head:
  - [[-1, -2], 1, td_lhfusion, ['p4']]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, td_lhfusion, ['p3']]
  - [-1, 3, C2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, td_lhfusion, ['p2']]
  - [-1, 3, C2f, [128]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, bu_lhfusion, [2]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, bu_lhfusion, [4, 5, 'avg_pool', 0.2]]
  - [-1, 3, C2f, [512]]

  - [[15, 18, 21], 1, AMSFHead, [nc]]